In [1]:
import numpy as np

In [2]:
import pandas as pb

In [47]:
from numpy.random import randn
np.random.seed(101)

In [48]:
df = pb.DataFrame(randn(5,4),['A','B','C','D','E'],['a','b','c','d'])

In [49]:
df

          a         b         c         d
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df['a']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: a, dtype: float64

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['a'])

pandas.core.series.Series

In [9]:
df['new']= df['a']+ df['b']

In [10]:
df

          a         b         c         d       new
A -0.355869 -1.002544 -1.602311 -0.156053 -1.358413
B -0.125872 -0.671872 -2.036399  0.424719 -0.797744
C  0.693852  0.121053  0.238168 -0.393792  0.814905
D -0.867245 -0.807900  0.993132 -0.707418 -1.675145
E -1.118071 -0.812493  1.286756 -0.522672 -1.930564

In [14]:
df.drop('new',axis=1,inplace=True)

In [15]:
df

          a         b         c         d
A -0.355869 -1.002544 -1.602311 -0.156053
B -0.125872 -0.671872 -2.036399  0.424719
C  0.693852  0.121053  0.238168 -0.393792
D -0.867245 -0.807900  0.993132 -0.707418
E -1.118071 -0.812493  1.286756 -0.522672

In [18]:
df.drop('E',axis=0,inplace=True)

In [19]:
df

          a         b         c         d
A -0.355869 -1.002544 -1.602311 -0.156053
B -0.125872 -0.671872 -2.036399  0.424719
C  0.693852  0.121053  0.238168 -0.393792
D -0.867245 -0.807900  0.993132 -0.707418

In [20]:
df.shape

(4, 4)

In [23]:
df['a']

A   -0.355869
B   -0.125872
C    0.693852
D   -0.867245
Name: a, dtype: float64

In [24]:
df.loc['A']

a   -0.355869
b   -1.002544
c   -1.602311
d   -0.156053
Name: A, dtype: float64

In [25]:
df.iloc[0]

a   -0.355869
b   -1.002544
c   -1.602311
d   -0.156053
Name: A, dtype: float64

In [27]:
df.loc['A','a']

-0.35586926534407803

In [28]:
df.loc[['A','C'],['a','c']]

          a         c
A -0.355869 -1.602311
C  0.693852  0.238168

In [29]:
df.loc['A']['a']

-0.35586926534407803

In [50]:
df>0

       a      b      c      d
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [51]:
df[df>0]

          a         b         c         d
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df['a']>0]

          a         b         c         d
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df['a']>0

A     True
B     True
C    False
D     True
E     True
Name: a, dtype: bool

In [55]:
df[df['a']<0]

          a         b         c         d
C -2.018168  0.740122  0.528813 -0.589001

In [60]:
df[df['a']>0][['a','b','c']]

          a         b         c
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [62]:
df[(df['a']>0) | (df['c']>1)]

          a         b         c         d
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
newind = 'co pk ln zy op'.split()

In [64]:
newind

['co', 'pk', 'ln', 'zy', 'op']

In [68]:
df['state1']=newind

In [72]:
df.drop('state',axis=1,inplace=True)

In [75]:
df.reset_index()

  index         a         b         c         d state1
0     A  2.706850  0.628133  0.907969  0.503826     co
1     B  0.651118 -0.319318 -0.848077  0.605965     pk
2     C -2.018168  0.740122  0.528813 -0.589001     ln
3     D  0.188695 -0.758872 -0.933237  0.955057     zy
4     E  0.190794  1.978757  2.605967  0.683509     op

In [76]:
df.set_index('state1')

               a         b         c         d
state1
co      2.706850  0.628133  0.907969  0.503826
pk      0.651118 -0.319318 -0.848077  0.605965
ln     -2.018168  0.740122  0.528813 -0.589001
zy      0.188695 -0.758872 -0.933237  0.955057
op      0.190794  1.978757  2.605967  0.683509

In [77]:
df
#need to keep inplace=True to make this permanent!

          a         b         c         d state1
A  2.706850  0.628133  0.907969  0.503826     co
B  0.651118 -0.319318 -0.848077  0.605965     pk
C -2.018168  0.740122  0.528813 -0.589001     ln
D  0.188695 -0.758872 -0.933237  0.955057     zy
E  0.190794  1.978757  2.605967  0.683509     op

In [78]:
out = ['G1','G1','G1','G2','G2','G2']
inp = [1,2,3,1,2,3]
hier_index = list(zip(out,inp))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [81]:
hier_out = pb.MultiIndex.from_tuples(hier_index)
hier_out

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [82]:
df1 = pb.DataFrame(randn(6,2),hier_out,['A','B'])
df1

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [84]:
df1.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [87]:
df1.loc['G1']['A']

1    0.302665
2   -1.706086
3   -0.134841
Name: A, dtype: float64

In [88]:
df1.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [94]:
df1.index.names=['groups','num']

In [95]:
df1

                   A         B
groups num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [96]:
df1.xs('G1')

            A         B
num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [101]:
df1.xs(1,level='num')

               A         B
groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [6]:
#missing data
import pandas as pb
import numpy as nm

In [7]:
s= {'A':[1,2,nm.nan],'B':[1,nm.nan,nm.nan],'C':[1,2,3]}

In [8]:
df = pb.DataFrame(s)

In [9]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()

     A    B  C
0  1.0  1.0  1

In [11]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [18]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [19]:
df.fillna(value='fill')

      A     B  C
0     1     1  1
1     2  fill  2
2  fill  fill  3

In [22]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [23]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [24]:
df.loc[1].fillna(value=df.loc[1].mean())

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64

In [27]:
df.loc[1].fillna(value=df.loc[1].mean())

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64

In [26]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [1]:
import pandas as pd
import numpy as nm
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'person':['sam','charlie','amy','vanessa','carl','sarah'],'sales':[200,120,340,124,243,350]}

In [5]:
s = pd.DataFrame(data)
s

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [7]:
s.groupby('company')

In [8]:
s.groupby('company').max()

          person  sales
company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    340

In [9]:
s.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [10]:
s.groupby('company').describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [12]:
s.groupby('company').describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [13]:
s.groupby('company').describe().loc['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [14]:
pd.concat([s,s,s])

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [15]:
pd.join(s,s,how='inner',on='company')

AttributeError: module 'pandas' has no attribute 'join'

In [17]:
pd.merge(s,s,how='outer',on='company')

   company person_x  sales_x person_y  sales_y
0     GOOG      sam      200      sam      200
1     GOOG      sam      200  charlie      120
2     GOOG  charlie      120      sam      200
3     GOOG  charlie      120  charlie      120
4     MSFT      amy      340      amy      340
5     MSFT      amy      340  vanessa      124
6     MSFT  vanessa      124      amy      340
7     MSFT  vanessa      124  vanessa      124
8       FB     carl      243     carl      243
9       FB     carl      243    sarah      350
10      FB    sarah      350     carl      243
11      FB    sarah      350    sarah      350

In [23]:
s1={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'person':['sam','charlie','amy','vanessa','carl','sarah'],'sales':[200,120,340,124,243,350]}
s1=pd.DataFrame(s1,index=[6,7,8,9,10,11])
s1

   company   person  sales
6     GOOG      sam    200
7     GOOG  charlie    120
8     MSFT      amy    340
9     MSFT  vanessa    124
10      FB     carl    243
11      FB    sarah    350

In [24]:
s.join(s1)

ValueError: columns overlap but no suffix specified: Index(['company', 'person', 'sales'], dtype='object')

In [5]:
#operations 

import pandas as pd
import numpy as nm
dr = {'col1' : [1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}
data = pd.DataFrame(dr)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
#unique
data['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
data['col2'].nunique()

3

In [9]:
data['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [11]:
data[(data['col1']>2) & (data['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [12]:
def times2(x):
    return x*2

In [13]:
data['col1'].sum()

10

In [15]:
data['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
data['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [18]:
data.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
data.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [21]:
data.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [1]:
da = {'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
da = pd.DataFrame(da)
da

NameError: name 'pd' is not defined

In [27]:
da.pivot_table(values='D',index = ['A','B'],columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [3]:
import pandas as pd
import numpy as nm
data = {'a':[0,4,8,12],'b':[1,5,9,13],'c':[2,6,10,14],'d':[3,7,11,15]}
data = pd.DataFrame(data)
data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
data.to_csv('my_out',index=False)

In [6]:
pd.read_csv('my_out')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [1]:
import pandas as pd

In [2]:
pwd

'D:\\Anaconda'

In [8]:
df = pd.read_csv('exa.csv')
df

    1   2   3
0   4   5   6
1   7   8   9
2  10  11  12

In [6]:
df.to_csv('check.csv',index=False)

In [7]:
pd.read_csv('check.csv')

    1   2   3
0   4   5   6
1   7   8   9
2  10  11  12

In [10]:
df.to_csv('check.csv')
pd.read_csv('check.csv')

   Unnamed: 0   1   2   3
0           0   4   5   6
1           1   7   8   9
2           2  10  11  12

In [11]:
df.to_excel('out.xlsx',sheet_name='Newsheet')

In [14]:
pd.read_excel('out.xlsx')

    1   2   3
0   4   5   6
1   7   8   9
2  10  11  12

In [15]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [16]:
type(data)

list

In [19]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [20]:
from sqlalchemy import create_engine

In [21]:
engine = create_engine('sqlite:///:memory:')

In [27]:
df.to_sql('mytable1',engine,index=False)

In [28]:
sqldf = pd.read_sql('mytable1',con=engine)

In [24]:
sqldf

   index   1   2   3
0      0   4   5   6
1      1   7   8   9
2      2  10  11  12